Revit 2024 API
HasValueFilterRule Properties
The HasValueFilterRule type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterRule.)
Parameter
 The parameter which will be evaluated to pass this rule.
 (Inherited from ParameterValuePresenceRule.)
See Also
HasValueFilterRule Class
Autodesk.Revit.DB Namespace